cf_billing/Documents/энргУстановитьПризнакСудебнойЗадолженностиАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргУстановитьПризнакСудебнойЗадолженностиАбонента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргСобственникиИДолжники</xr:Item>
				<xr:Item>InformationRegister.энргПризнакСудебнойЗадолженностиАбонента</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакСудебнойЗадолженности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокДолжников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргСобственникиИДолжники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСобственникиИДолжники</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/энргКлючиПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргКлючиПомещений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Documents/энргУстановитьПризнакСудебнойЗадолженностиАбонента/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(ТекущийОбъект.КлючПомещения);
	ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат); 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы  

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	иначе
		Объект.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ЭтаФорма.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	КонецЕсли; 
	
	ЗаполнитьДолжниковПоАбоненту();
КонецПроцедуры   

#КонецОбласти  

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеКлючаПомещения(Знач ДанныеПомещенияРезультат)
	
	Перем ДанныеПомещенияВыборка;
	
	Если Не ДанныеПомещенияРезультат.Пустой() Тогда
		ДанныеПомещенияВыборка  = ДанныеПомещенияРезультат.Выбрать();
		ДанныеПомещенияВыборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеПомещенияВыборка,"Строение,Помещение,ЧастныйСектор");
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьДолжниковПоАбоненту() 
	ДатаОтбор = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
	РезультатЗапроса = РегистрыСведений.энргСобственникиИДолжники.АктуальныеДолжники(Объект.Абонент, ДатаОтбор);  
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТЗДолжники = РезультатЗапроса.Выгрузить();
	Объект.СписокДолжников.Загрузить(ТЗДолжники);
КонецПроцедуры

#КонецОбласти
